package Mod2;

/*
Магическим квадратом порядка n называется квадратная матрица размером n x n, составленная из чисел 1, 2, 3, ...n^2 так,
что суммы по каждому столбцу, каждой строке и каждой из двух больших диагоналей равны между собой. Построить такой
квадрат. Пример магического квадрата порядка 3:
6 1 8
7 5 3
2 9 4

public class DoubleArrays16 {
    public static void main(String[] args) {

        int n = 3;
        int[][] matrice = new int[n][n];
        for (int i = 0; i < n; i++) {
            for (int j = 0; j < n; j++) {

            }
        }
        int indexI = 0;
        int indexJ = n/2;


    }
}


 */